Revit 2026 API

# WorksetPreview Properties

---

The WorksetPreview type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | Id of the workset. |
|  | IsDefaultWorkset | Whether the workset is the default one. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | Name of the workset. |
|  | Owner | User name of the workset. |
|  | UniqueId | UniqueId of the workset. |

#### Reference

WorksetPreview Class

Autodesk.Revit.DB Namespace